<a href="https://colab.research.google.com/github/hwayoung306/AI/blob/main/20220414_py_05_Pandas_ipynb_%EA%B3%B5%EB%B6%80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### 구글드라이브 연동

In [107]:
# 구글드라이브 연동
from google.colab import drive
drive.mount('/gdrive', force_remount=True)

# 구글 드라이브 파일 확인
!ls '/gdrive/My Drive/temp/'

# 반복되는 드라이브 경로 변수화
drive_path = '/gdrive/My Drive/temp/'

Mounted at /gdrive
 매수종목1.txt			        sample1.pdf
'2. 영화평점, 날짜별 영화평점 시각화'  'sample (1).xlsx'
 매수종목2.txt			        sample2.pdf
 auto-mpg.csv			        sample.docx
 bmi_500.csv			        sample_merge.pdf
 매수종목.csv			        sample.xlsx
'demo (1).docx'			        score.csv
 demo.docx			        test.db.db
 example.docx			        test.txt
 height_weight.txt		        Titanic배포용
 hello_world.xlsx		        titanic_test.csv
 HelloWorld.xlsx		        titanic_train.csv
'little-char (1).png'		        titanic.xls
 little-char.png		        Traffic_Accident_2017.csv
 population_number.csv		        train.csv
 ram_price.csv			        user_id_mean.csv
 ratings_small.txt		        wine.csv
'sample1 (1).pdf'		        남북한발전전력량.xlsx

# Pandas
데이터 핸들링
-> 표 데이터

## Pandas 기초
Pandas 모듈
- Series Class : 1차원
 - 인덱스(index) + 값(value)
 - 인덱스조 자료형이다
- DataFrame Class : 2차원
 - 표와 같은 형태
 - 제일 많이 다룸

In [1]:
import pandas as pd

### Series

In [2]:
# 1차원 데이터
# 생성 (세로모양)
s = pd.Series( [4, 7, -5, 3])
s

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# 인덱싱을 다른 것으로 넣고 싶을 때
s = pd.Series( [4, 7, -5, 3], index = ['a', 'b', 'c', 'd'])
s

a    4
b    7
c   -5
d    3
dtype: int64

In [6]:
# 값, 인덱
print( s.values )
print( s.index ) # 문자열은 object 형식으로 들어감
print( s.dtype )

[ 4  7 -5  3]
Index(['a', 'b', 'c', 'd'], dtype='object')
int64

#### Pandas 연습 01
각 도시의 2015년 인구 데이터를 시리즈로 만드시오.
```
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
```

In [47]:
data = pd.Series([9904312,3448797,2890451,2466052], index=['서울','부산','인천','대구'])
data

서울    9904312
부산    3448797
인천    2890451
대구    2466052
dtype: int64

#### Series

In [22]:
# Serise 이름 지정 (컬럼 명)
data.name = '인구' # 이 시리즈는 인구에 대한거야!
data.index.name = '도시' # 인덱스는 도시에 대한거야!
data

도시
서울    9904312
부산    3448797
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [23]:
# Serise 연산 (values에 연산이 됨)
data / 1000000

도시
서울    9.904312
부산    3.448797
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [24]:
# 인덱스
s1 = pd.Series( [4, 7, -5, 3])
s1[0]

4

In [59]:
# 딕셔너리처럼 사용이 가능하다
data['서울'], data[0]

(9904312, 9904312)

In [60]:
data[3], data['대구']

(2466052, 2466052)

In [61]:
# 팬시인덱스 사용 가능 근데 잘 사용 안함 정확한 인덱싱 하기 위해 '서울','대구','부산' 이렇게 가져옴
# 팬시 인덱싱으로 서울, 대구, 부산만 가져오기!
data[ [0, 3, 1]]

서울    9904312
대구    2466052
부산    3448797
dtype: int64

In [62]:
# 슬라이싱
# 숫자로하면 시작:끝+1
print(data[1:3])

# 인덱스 이름으로 하면 시작:끝
print(data['부산':'인천'])

부산    3448797
인천    2890451
dtype: int64
부산    3448797
인천    2890451
dtype: int64

In [63]:
# Boolean 인덱싱
# 인구 250만 이상
print(data >= 2500000)
data[data >= 2500000]

서울     True
부산     True
인천     True
대구    False
dtype: bool

서울    9904312
부산    3448797
인천    2890451
dtype: int64

In [64]:
# 인구 500만 이하
data[data <= 5000000]

부산    3448797
인천    2890451
대구    2466052
dtype: int64

In [65]:
# 인구 250만 이상 500만 이하 도시
s1 = data[ data >= 2500000 ]
s1[ s1 <= 5000000 ]

# 또는
data[ (data >= 2500000) & (data <= 5000000 ) ]
# 또는
data[ data >= 2500000 ][ data <= 5000000 ]

부산    3448797
인천    2890451
dtype: int64

In [55]:
# 딕셔너리 객체로 시리즈 생성 (2010년 인구)
data2 = {'서울': 9631482, '부산': 3393191, '인천': 2632035, '대전': 1490158}
s2 = pd.Series(data2)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [52]:
# 2015년도와 2010년도의 인구 증가율 계산
ds = data - s2
ds

대구         NaN
대전         NaN
부산     55606.0
서울    272830.0
인천    258416.0
dtype: float64

In [56]:
3# 결과가 없는 것은 무시 (NaN)
ds[ds.notnull()]

부산     55606.0
서울    272830.0
인천    258416.0
dtype: float64

In [68]:
ds [ ds.isnull() ]

대구   NaN
대전   NaN
dtype: float64

In [74]:
rs = (data - s2) / s2 *100
rs[ rs.notnull() ]

부산    1.638752
서울    2.832690
인천    9.818107
dtype: float64

In [75]:
# Series 데이터 갱신, 추가, 삭제
# 갱신
rs['부산'] = 1.6
rs['대구'] = 1.41

# 삭제
del rs['서울']
rs

### DataFrame

In [78]:
# DataFrame 생성
data = {"2015": [9904312, 3448737, 2890451, 2466052],
        "2010": [9631482, 3393191, 2632035, 2431774]}

df = pd.DataFrame(data)
display( df )

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [79]:
# DataFrame 인덱스 수정
df.index = ['서울','부산','인천','대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [80]:
# DataFrame 인덱스 지정하여 생성
data = [[9904312, 3448737, 2890451, 2466052],
        [9631482, 3393191, 2632035, 2431774]]
ind = ['2015', '2010']
col = ['서울','부산','인천','대구']
df2 = pd.DataFrame( data, index=ind, columns=col )
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [81]:
# 테이블 돌리기
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

#### Pandas 연습 02
DataFrame을 이용하여 아래와 같은 결과를 구성하시오.

| |홍길동|	김사또|	임꺽정|
|---|---|---|---|
|키|	175.3|	180.2|	178.6|
|몸무게|	66.2|	78.9|	55.1|
|나이|	27.0|	49.0|	35.0|

In [83]:
data = [[175.3, 180.2, 178.6],[66.2, 78.9, 55.1],[27.0, 49.0, 35.0]]
ind = ['키', '몸무게', '나이']
col = ['홍길동', '김사또', '임꺽정']
df3 = pd.DataFrame( data, index = ind, columns = col )
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

#### DataFrame

In [84]:
 # 값 확인
 # 인덱스 확인
 # 컬럼 확인

df3.values
df3.index
df3.columns

Index(['홍길동', '김사또', '임꺽정'], dtype='object')

In [89]:
# DataFrame 열 
print( df['2015'])
print( df[['2015', '2010']] ) # 순서유지
print( df[['2010', '2015']])

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64
       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774
       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [90]:
# "2005" 라는 컬럼명으로 2005년 인구수 대입
data_2005 =  [9762546, 3512547, 2517680, 2456016]
df['2005'] = data_2005
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [93]:
# 행 인덱스 (행의 인덱스 번호로도 가능하고, index 명으로도 가능하다)
display( df[:1])

print()

display( df['서울':'인천'])

       2015     2010     2005
서울  9904312  9631482  9762546

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [98]:
# Boolean 인덱스 (조건 검색)
df[df['2010'] >= 2500000]

df[df['2015'] >= 2500000]['2010']

서울    9631482
부산    3393191
인천    2632035
Name: 2010, dtype: int64

#### loc, iloc 인덱서

In [101]:
# loc[] - 실제 인덱스를 사용하여 행을 가지고 올 때 사용
# df.loc[행, 열]
df.loc['서울':'부산', '2015':'2010']

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [104]:
# iloc[] - numpy의 array인덱싱 방식으로 행을 가지고 올 때 사용
print(df)
print()

print("3번 인덱스인 대구 내용이 출력됨")
df.iloc[3]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

3번 인덱스인 대구 내용이 출력됨

2015    2466052
2010    2431774
2005    2456016
Name: 대구, dtype: int64

In [105]:
# iloc[] - numpy의 array인덱싱 방식으로 행을 가지고 올 때 사용
print(df)
print()

print("서울, 부산의 2015, 2010데이터")
df.iloc[:2, :2]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

서울, 부산의 2015, 2010데이터

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

#### csv 파일-1

population_number.csv

In [112]:
df = pd.read_csv(drive_path + 'population_number.csv',index_col= '도시', encoding='euc-kr')
df

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [113]:
# count() : 데이터의 갯수 / 열의 데이터
df.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [116]:
# value_counts 함수
# - 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 셀 수 있다.
import numpy as np

# 0~5까지 수가 들어있는 ndarray 만들어서 각 값들이 몇개씩 들어잇는지
s = pd.Series( np.random.randint(6, size = 100))
s.value_counts()

5    22
0    18
2    18
4    16
3    13
1    13
dtype: int64

In [119]:
# head() tail() 기본적 5개 / ()안에 수를 넣으면 그 수만큼 출력
print(s.head(10))
print(s.tail())

0    3
1    5
2    5
3    3
4    0
5    4
6    3
7    5
8    5
9    2
dtype: int64
95    0
96    3
97    1
98    4
99    0
dtype: int64

In [ ]:
# 정렬
# sort_index 함수 : 인덱스 값을 기준으로 정렬한다.
# sort_values 함수 : 데이터 값을 기준으로 정렬한다.

In [ ]:
# DataFrame을 2010년 인구수 기준으로 정렬

In [ ]:
# DataFrame을 지역, 2010년 인구수 기준으로 정렬

#### csv 파일-2

score.csv

In [ ]:
# 학급별 총계

In [ ]:
# 학급별 순위

In [ ]:
# 과목별 총계

In [ ]:
# 과목별 합계를 DataFrame에 추가

#### Pandas 연습 03-1

과목별 평균을 계산하여 column 추가하기
```

        1반  2반	3반	4반	합계	평균
과목						
수학	45	44	73	39	201	50.25
영어	76	92	45	69	282	70.50
국어	47	92	45	69	253	63.25
사회	92	81	85	40	298	74.50
과학	11	79	47	26	163	40.75
```

#### Pandas 연습 03-2

반평균을 계산 하여 row 추가 하기
```
	      1반	2반	 3반 	4반 	합계	평균
과목						
수학	45.0	44.0	73.0	39.0	201.0	50.25
영어	76.0	92.0	45.0	69.0	282.0	70.50
국어	47.0	92.0	45.0	69.0	253.0	63.25
사회	92.0	81.0	85.0	40.0	298.0	74.50
과학	11.0	79.0	47.0	26.0	163.0	40.75
반평균  54.2	77.6	59.0	48.6	239.4	59.85
```

#### Pandas 연습 03-3

반 평균, 합계, 평균을 제외한 데이터 중 과목별 가장 큰 값, 작은 값을 구하시오.

```
과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64
```
```
과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64
```

#### Pandas 연습 03-4

과목별 가장 큰 값과 작은 값의 차를 구하시오.
```
과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64
```

#### apply 변환

행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용
```
DataFrame.apply( func, axis = 0)
```

#### 카테고리

In [ ]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]

#### Pandas 연습 04-1

1. 타이타닉호 승객 데이터(train.csv)를 데이터프레임으로 읽어 온다.

2. 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

```
Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64
```

#### Pandas 연습 04-2

1. 타이타닉호 승객 중 성별(Sex) 인원수, 나이별(Age) 인원수, 선실별(Pclass) 인원수, 사망/생존(Survived) 인원수를 구하라.

#### Pandas 연습 04-3

1. 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해  ‘미성년자‘, ‘청년‘, ‘중년‘, ‘장년‘, ‘노년’ 승객의 비율을 구하라.

(단, 그룹별 비율의 전체 합은 1이 되어야 한다.)
```
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

In [ ]:
# 생존자 그룹

In [ ]:
# 생존자 그룹 카테고리화

In [ ]:
# 비율

In [ ]:
# 사망자 그룹

In [ ]:
# 사망자 그룹 카테고리화

In [ ]:
# 비율

#### groupby

In [ ]:
df5 = pd.DataFrame({
    'key1':['A','A', 'B', 'B', 'A'],
    'key2':['one','two','one','two','one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df5

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

#### Pandas 연습 04-4

1. 선실(Pclass), 성별(Sex)로 생존자 수를 구하라.

## Pandas 요약

### 데이터프레임(Dataframe)과 시리즈(Series)

In [ ]:
# 시리즈와 데이터프레임 두 가지가 기본이다
# 자동으로 인덱스가 만들어진다

import numpy as np
import pandas as pd

In [ ]:
dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}

In [ ]:
#'year', 'city', 'temp'

In [ ]:
# index -> 'a','b','c','d','e'

In [ ]:
# columns -> '도시','연도','날씨'

In [ ]:
# index -> '도시'

### 람다 함수

In [ ]:
f = lambda x: x.max() - x.min()

df = pd.DataFrame(np.arange(12).reshape(4, 3), 
                  columns=['A', 'B', 'C'], index=['a', 'b', 'c', 'd'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

### Series

In [ ]:
# 파이썬 기본 타입인  딕셔너리로부터 시리즈를 만들 수 있다
dic = {'서울':800, '부산':150, '대구': 100}
dic

{'대구': 100, '부산': 150, '서울': 800}